{
    "imm32.dll": "imm32.dll is a library used by the Microsoft Windows Input Method Manager (IMM). The file imm32.dll, is required for windows to operate. If imm32.dll is unavailable, any applications that use this library will stop working. imm32.dll is flagged as a system process and does not appear to be a security risk. However, removing Windows IMM32 API Client Library may adversely impact your system. imm32.dll is a system process that is needed for your PC to work properly. It should not be removed. Check your system now to identify unused processes that are slowing down your computer.",
    "gdi32.dll": "gdi32.dll contains functions for the Windows GDI (Graphical Device Interface) which assists windows in creating simple 2-dimensional objects. gdi32.dll is a system process that is needed for your PC to work properly. It should not be removed. Check your system now to identify unused processes that are slowing down your computer.",
    "user32.dll": "user32.dll is a module that contains Windows API functions related the Windows user interface (Window handling, basic UI functions, and so forth). user32.dll is a system process that is needed for your PC to work properly. It should not be removed. Check your system now to identify unused processes that are slowing down your computer.",
    "kernel32.dll": "kernel32.dll is the most important Microsoft Windows Kernel. Functionality addressing most of windows functions are linked to this kernel DLL in some way. The Kernel32.dll file is a 32-bit dynamic link library file used in Windows 95,98 and Me. The Kernel32.dll file handles memory management, input/output operations and interrupts. When you start Windows, Kernel32.dll is loaded into a protected memory space so that other programs do not take it over. kernel32.dll is a system process that is needed for your PC to work properly. It should not be removed. Check your system now to identify unused processes that are slowing down your computer.",
    "msvcrt.dll": "msvcrt.dll is a module containing standard C library functions such as printf, memcpy, and cos. It is a part of the Microsoft C Runtime Library. Non-system processes like msvcrt.dll originate from software you installed on your system. Since most applications store data in your system's registry, it is likely that over time your registry suffers fragmentation and accumulates invalid entries which can affect your PC's performance. It is recommended that you check your registry to identify slowdown issues.",
    "imagehlp.dll": "imagehlp.dll is a module containing the Windows Debug Help library used for debugging and error handling on Windows NT operating systems and later. This program is important for the stable and secure running of your computer and should not be terminated. imagehlp.dll is also a process belonging to an advertising program by WebSearch. This module monitors your browsing habits and distributes the data back to the author's servers for analysis. This also prompts advertising popups. This process is a security risk and should be removed from your system. imagehlp.dll is a system process that is needed for your PC to work properly. It should not be removed. Check your system now to identify unused processes that are slowing down your computer.",
    "oleaut32.dll": "oleaut32.dll is a library which contains core OLE functions. Non-system processes like oleaut32.dll originate from software you installed on your system. Since most applications store data in your system's registry, it is likely that over time your registry suffers fragmentation and accumulates invalid entries which can affect your PC's performance. It is recommended that you check your registry to identify slowdown issues.",
    "rsaenh.dll": "rsaenh.dll is a module that implements the Microsoft enhanced cryptographic service provider (CSP) that uses 128-bit encryption. rsaenh.dll is a system process that is needed for your PC to work properly. It should not be removed. Check your system now to identify unused processes that are slowing down your computer.",
    "crypt32.dll": "crypt32.dll is a module that contains the functions used by the Windows Crypto API. It is being used by various applications. crypt32.dll is a system process that is needed for your PC to work properly. It should not be removed. Check your system now to identify unused processes that are slowing down your computer.",
    "advapi32.dll": "advapi32.dll is a part of an advanced API services library supporting numerous APIs including many security and registry calls. It is a non essential process however it should not be removed if not causing any problems. advapi32.dll is a system process that is needed for your PC to work properly. It should not be removed. Check your system now to identify unused processes that are slowing down your computer.",
    "lpk.dll": "LPK.dll is a language pack file, and has recently caused problems in Windows 7 machines.To reinstall LPK.dll, try the following steps: Click the Start button and type cmd and right-click on the appearing item, and choose Run as Administrator.Type sfc/scannow. This will scan for integrity issues. Restart your computer.If the method above doesn't help, check if you can find LPK.dll in C:\\Windows\\System32 folder. If you have found it there, just double click it to add to the registry again. Non-system processes like lpk.dll originate from software you installed on your system. Since most applications store data in your system's registry, it is likely that over time your registry suffers fragmentation and accumulates invalid entries which can affect your PC's performance. It is recommended that you check your registry to identify slowdown issues.",
    "ole32.dll": "ole32.dll is a library which contains core OLE functions. ole32.dll is a system process that is needed for your PC to work properly. It should not be removed. Check your system now to identify unused processes that are slowing down your computer.",
    "comctl32.dll": "comctl32.dll is a module that contains common GUI components used by Windows applications. comctl32.dll is a system process that is needed for your PC to work properly. It should not be removed. Check your system now to identify unused processes that are slowing down your computer.",
    "shell32.dll": "shell32.dll is a library which contains Windows Shell API functions, which are used when opening web pages and files. shell32.dll is a system process that is needed for your PC to work properly. It should not be removed. Check your system now to identify unused processes that are slowing down your computer.",
    "ws2_32.dll": "File that contains the Windows Sockets API used by most Internet and network applications to handle network connections. ws2_32.dll is a system process that is needed for your PC to work properly. It should not be removed. Check your system now to identify unused processes that are slowing down your computer.",
    "shlwapi.dll": "shlwapi.dll is a library which contains functions for UNC and URL paths, registry entries, and color settings. shlwapi.dll is a system process that is needed for your PC to work properly. It should not be removed. Check your system now to identify unused processes that are slowing down your computer.",
    "icmp.dll": "icmp.dll is a module used by Windows 2000 products. icmp.dll is a system process that is needed for your PC to work properly. It should not be removed. Check your system now to identify unused processes that are slowing down your computer."
}